Senseg/lpc21isp/lpcprog.c
/******************************************************************************

Project:           Portable command line ISP for Philips LPC2000 family
                   and Analog Devices ADUC70xx

Filename:          lpcprog.c

Compiler:          Microsoft VC 6/7, GCC Cygwin, GCC Linux, GCC ARM ELF

Author:            Martin Maurer (Martin.Maurer@clibb.de)

Copyright:         (c) Martin Maurer 2003-2008, All rights reserved
Portions Copyright (c) by Aeolus Development 2004 http://www.aeolusdevelopment.com

    This file is part of lpc21isp.

    lpc21isp is free software: you can redistribute it and/or modify
    it under the terms of the GNU Lesser General Public License as published by
    the Free Software Foundation, either version 3 of the License, or
    any later version.

    lpc21isp is distributed in the hope that it will be useful,
    but WITHOUT ANY WARRANTY; without even the implied warranty of
    MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
    GNU Lesser General Public License for more details.

    You should have received a copy of the GNU Lesser General Public License
    and GNU General Public License along with lpc21isp.
    If not, see <http://www.gnu.org/licenses/>.
*/

// This file is for the Actual Programming of the LPC Chips

#if defined(_WIN32)
#if !defined __BORLANDC__
#include "StdAfx.h"
#endif
#endif // defined(_WIN32)
#include "lpc21isp.h"

#ifdef LPC_SUPPORT
#include "lpcprog.h"

static const unsigned int SectorTable_210x[] =
{
    8192, 8192, 8192, 8192, 8192, 8192, 8192, 8192,
    8192, 8192, 8192, 8192, 8192, 8192, 8192
};

static const unsigned int SectorTable_2103[] =
{
    4096, 4096, 4096, 4096, 4096, 4096, 4096, 4096
};

static const unsigned int SectorTable_2109[] =
{
    8192, 8192, 8192, 8192, 8192, 8192, 8192, 8192
};

static const unsigned int SectorTable_211x[] =
{
    8192, 8192, 8192, 8192, 8192, 8192, 8192, 8192,
    8192, 8192, 8192, 8192, 8192, 8192, 8192,
};

static const unsigned int SectorTable_212x[] =
{
    8192, 8192, 8192, 8192, 8192, 8192, 8192, 8192,
    65536, 65536, 8192, 8192, 8192, 8192, 8192, 8192, 8192
};

// Used for devices with 500K (LPC2138 and LPC2148) and
// for devices with 504K (1 extra 4k block at the end)
static const unsigned int SectorTable_213x[] =
{
     4096,  4096,  4096,  4096,  4096,  4096,  4096,  4096,
    32768, 32768, 32768, 32768, 32768, 32768, 32768, 32768,
    32768, 32768, 32768, 32768, 32768, 32768,  4096,  4096,
     4096,  4096,  4096,  4096
};

static int unsigned SectorTable_RAM[]  = { 65000 };

static LPC_DEVICE_TYPE LPCtypes[] =
{
    { 0, 0, 0 },  /* unknown */
    { 0x0004FF11, 2103,  32,  8,  8, 4096, SectorTable_2103 },
    { 0xFFF0FF12, 2104, 128, 16, 15, 8192, SectorTable_210x },
    { 0xFFF0FF22, 2105, 128, 32, 15, 8192, SectorTable_210x },
    { 0xFFF0FF32, 2106, 128, 64, 15, 8192, SectorTable_210x },
    { 0x0201FF01, 2109,  64,  8,  8, 4096, SectorTable_2109 },
    { 0x0101FF12, 2114, 128, 16, 15, 8192, SectorTable_211x },
    { 0x0201FF12, 2119, 128, 16, 15, 8192, SectorTable_211x },
    { 0x0101FF13, 2124, 256, 16, 17, 8192, SectorTable_212x },
    { 0x0201FF13, 2129, 256, 16, 17, 8192, SectorTable_212x },
    { 0x0002FF01, 2131,  32,  8,  8, 4096, SectorTable_213x },
    { 0x0002FF11, 2132,  64, 16,  9, 4096, SectorTable_213x },
    { 0x0002FF12, 2134, 128, 16, 11, 4096, SectorTable_213x },
    { 0x0002FF23, 2136, 256, 32, 15, 4096, SectorTable_213x },
    { 0x0002FF25, 2138, 512, 32, 27, 4096, SectorTable_213x },
    { 0x0402FF01, 2141,  32,  8,  8, 4096, SectorTable_213x },
    { 0x0402FF11, 2142,  64, 16,  9, 4096, SectorTable_213x },
    { 0x0402FF12, 2144, 128, 16, 11, 4096, SectorTable_213x },
    { 0x0402FF23, 2146, 256, 40, 15, 4096, SectorTable_213x },
    { 0x0402FF25, 2148, 512, 40, 27, 4096, SectorTable_213x },
    { 0x0301FF13, 2194, 256, 16, 17, 8192, SectorTable_212x },
    { 0x0301FF12, 2210,   0, 16,  0, 8192, SectorTable_211x }, /* table is a "don't care" */
    { 0x0401FF12, 2212, 128, 16, 15, 8192, SectorTable_211x },
    { 0x0601FF13, 2214, 256, 16, 17, 8192, SectorTable_212x },
    /*            2290; same id as the LPC2210 */
    { 0x0401FF13, 2292, 256, 16, 17, 8192, SectorTable_212x },
    { 0x0501FF13, 2294, 256, 16, 17, 8192, SectorTable_212x },
    { 0x00000000, 2361, 128, 34, 11, 4096, SectorTable_213x },
    { 0x00000000, 2362, 128, 34, 11, 4096, SectorTable_213x },
    { 0x1600F902, 2364, 128, 34, 11, 4096, SectorTable_213x },
    { 0x1600E823, 2365, 256, 58, 15, 4096, SectorTable_213x },
    { 0x1600F923, 2366, 256, 58, 15, 4096, SectorTable_213x },
    { 0x1600E825, 2367, 512, 58, 15, 4096, SectorTable_213x },
    { 0x1600F925, 2368, 512, 58, 28, 4096, SectorTable_213x },
    { 0x1700E825, 2377, 512, 58, 28, 4096, SectorTable_213x },
    { 0x1700FD25, 2378, 512, 58, 28, 4096, SectorTable_213x },
    { 0x1800F935, 2387, 512, 98, 28, 4096, SectorTable_213x },
    { 0x1800FF35, 2388, 512, 98, 28, 4096, SectorTable_213x },
    { 0x1500FF35, 2458, 512, 98, 28, 4096, SectorTable_213x },
    { 0x1600FF30, 2460,   0, 98,  0, 4096, SectorTable_213x },
    { 0x1600FF35, 2468, 512, 98, 28, 4096, SectorTable_213x },
    { 0x1701FF30, 2470,   0, 98,  0, 4096, SectorTable_213x },
    { 0x1701FF35, 2478, 512, 98, 28, 4096, SectorTable_213x }
};

/***************************** PHILIPS Download *********************************/
/**  Download the file from the internal memory image to the philips microcontroller.
*   This function is visible from outside if COMPILE_FOR_LPC21
*/

static int SendAndVerify(ISP_ENVIRONMENT *IspEnvironment, const char *Command,
                                 char *AnswerBuffer, int AnswerLength)
{
    unsigned long realsize;
    int cmdlen;

    SendComPort(IspEnvironment, Command);
    ReceiveComPort(IspEnvironment, AnswerBuffer, AnswerLength - 1, &realsize, 2, 5000);
    cmdlen = strlen(Command);
    return (strncmp(AnswerBuffer, Command, cmdlen) == 0
        && strcmp(AnswerBuffer + cmdlen, "0\r\n") == 0);
}



/***************************** PhilipsOutputErrorMessage ***********************/
/**  Given an error number find and print the appropriate error message.
\param [in] ErrorNumber The number of the error.
*/
#if defined COMPILE_FOR_LPC21

#define PhilipsOutputErrorMessage(in)        // Cleanly remove this feature from the embedded version !!

#else

static void PhilipsOutputErrorMessage(unsigned char ErrorNumber)
{
    switch (ErrorNumber)
    {
    case   0:
        DebugPrintf(1, "CMD_SUCCESS\n");
        break;

    case   1:
        DebugPrintf(1, "INVALID_COMMAND\n");
        break;

